// Находим элементы на странице

// Функции

	// Отменяем отправку формы


	// Достаем текст задачи из поля ввода


	// Описываем задачу в виде объекта


	// Добавляем задачу в массив с задачами

	// Сохраняем список задач в хранилище браузера localStorage


	// Рендерим задачу на странице


	// Очищаем поле ввода и возвращаем на него фокус

	// Проверяем если клик был НЕ по кнопке "удалить задачу"
	

	// Определяем ID задачи
	
	// Удаляем задча через фильтрацию массива
	
	// Сохраняем список задач в хранилище браузера localStorage
	

	// Удаляем задачу из разметки
	

	// Проверяем что клик был НЕ по кнопке "задача выполнена"
	

	// Определяем ID задачи

	// Сохраняем список задач в хранилище браузера localStorage


	// Формируем CSS класс
	

	// Формируем разметку для новой задачи
	
	// Добавляем задачу на страницу
